In [1]:
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
import json
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus
from sqlalchemy import text

## Loading in the CSV files

In [3]:
races_path = 'csv/races.csv'
runners_path = 'csv/runners.csv'
training_path = 'csv/training_details.csv'
users_path = 'csv/users.csv'

In [4]:
races = pd.read_csv(races_path)
runners = pd.read_csv(runners_path)
training_details = pd.read_csv(training_path)
users = pd.read_csv(users_path)

In [5]:
races.head

<bound method NDFrame.head of    id           event  winner_id
0   1  100 meter dash        2.0
1   2  500 meter dash        3.0
2   3   cross-country        2.0
3   4      triathalon        NaN>

In [6]:
races.set_index('id',inplace=True)

In [7]:
races

             event  winner_id
id
1   100 meter dash        2.0
2   500 meter dash        3.0
3    cross-country        2.0
4       triathalon        NaN

In [8]:
runners.set_index('id',inplace=True)

In [9]:
runners

           name
id
1      John Doe
2      Jane Doe
3   Alice Jones
4   Bobby Louis
5   Lisa Romero

In [10]:
training_details.set_index('user_training_id',inplace=True)

In [11]:
training_details

                  user_id  training_id training_date
user_training_id
1                       1            1      8/2/2015
2                       2            1      8/3/2015
3                       3            2      8/2/2015
4                       4            2      8/4/2015
5                       2            2      8/3/2015
6                       1            1      8/2/2015
7                       3            2      8/4/2015
8                       4            3      8/3/2015
9                       1            4      8/3/2015
10                      3            1      8/2/2015
11                      4            2      8/4/2015
12                      3            2      8/2/2015
13                      1            1      8/2/2015
14                      4            3      8/3/2015

In [12]:
users.set_index('user_id',inplace=True)

In [13]:
users

            username
user_id
1           John Doe
2           Jane Doe
3        Alice Jones
4        Lisa Romero

## Setting up MySQL Connection

In [14]:
with open('/Users/Admin/.secret/sql_password.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [15]:
username = 'root'
password = login['password']
db_name = 'collinson_test_parkerh'
connection = f'mysql+pymysql://{username}:{password}@localhost/{db_name}'
engine = create_engine(connection)
conn = engine.connect()

In [16]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_collinson_test_parkerh
0                            races
1                          runners
2                 training_details
3                            users

## Inserting Data Into SQL

In [17]:
races.to_sql("races",conn,index=True, if_exists='replace')

4

In [18]:
runners.to_sql("runners",conn,index=True, if_exists='replace')

5

In [19]:
training_details.to_sql("training_details",conn,index=True, if_exists='replace')

14

In [20]:
users.to_sql("users",conn,index=True, if_exists='replace')

4

## Verifying Data has been input into tables

In [21]:
q = """SELECT *
FROM training_details"""
pd.read_sql(q, conn)

    user_training_id  user_id  training_id training_date
0                  1        1            1      8/2/2015
1                  2        2            1      8/3/2015
2                  3        3            2      8/2/2015
3                  4        4            2      8/4/2015
4                  5        2            2      8/3/2015
5                  6        1            1      8/2/2015
6                  7        3            2      8/4/2015
7                  8        4            3      8/3/2015
8                  9        1            4      8/3/2015
9                 10        3            1      8/2/2015
10                11        4            2      8/4/2015
11                12        3            2      8/2/2015
12                13        1            1      8/2/2015
13                14        4            3      8/3/2015

In [22]:
q = """SELECT *
FROM runners"""
pd.read_sql(q, conn)

   id         name
0   1     John Doe
1   2     Jane Doe
2   3  Alice Jones
3   4  Bobby Louis
4   5  Lisa Romero

In [23]:
q = """SELECT *
FROM races"""
pd.read_sql(q, conn)

   id           event  winner_id
0   1  100 meter dash        2.0
1   2  500 meter dash        3.0
2   3   cross-country        2.0
3   4      triathalon        NaN

# Question 1: What does UNION do? What is the difference between UNION and UNION ALL?
UNION statement will return all values of SELECT statements combined into one column. This makes viewing SELECT of multiple tables easily fit into one return.
      	UNION ALL will do the same, except it will show duplicate values. Previously UNION would only show duplicate values once, whereas UNION ALL will show the value exactly how many times it appears in the tables

In [35]:
q = '''SELECT name FROM runners
UNION
SELECT username FROM users'''
pd.read_sql(q,conn)

          name
0     John Doe
1     Jane Doe
2  Alice Jones
3  Bobby Louis
4  Lisa Romero

In [34]:
q = '''SELECT name FROM runners
UNION ALL
SELECT username FROM users'''
pd.read_sql(q,conn)

          name
0     John Doe
1     Jane Doe
2  Alice Jones
3  Bobby Louis
4  Lisa Romero
5     John Doe
6     Jane Doe
7  Alice Jones
8  Lisa Romero

# Question 2: Given the below query what will the result be and provide an alternate query to correct it.

In [24]:
q = '''SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races)'''
pd.read_sql(q,conn)

Empty DataFrame
Columns: [id, name]
Index: []

## This query is trying to show the runners who have not won any races. It's looking for rows that don't have an ID in the winner_id column from the races table. The NOT IN function does not handle NULL by default, and since we have a NULL value it messes up the entire query.

## Below I have added a "IS NOT NULL" to the WHERE winner_id clause to address the NULL issue.

In [25]:
q = '''SELECT * FROM runners WHERE id NOT IN (SELECT winner_id FROM races WHERE winner_id IS NOT NULL);'''
pd.read_sql(q,conn)

   id         name
0   1     John Doe
1   4  Bobby Louis
2   5  Lisa Romero

## We can also use a LEFT JOIN where we only get records returned that have no match in the other table.

In [26]:
q = '''SELECT runners.*
FROM runners
LEFT JOIN races ON runners.id = races.winner_id
WHERE races.id IS NULL;'''
pd.read_sql(q,conn)

   id         name
0   1     John Doe
1   4  Bobby Louis
2   5  Lisa Romero

## 3.	What are the NVL and the NVL2 functions in SQL? How do they differ?

### These are OracleDB functions and they are used to handle NULL values.
 - NVL is used to return NULL with a default value we have specified.
 - NVL2 is used to return one value if an expression is not NULL and another value if it is NULL.
 - The main differences in the coding would be below
### SELECT NVL(column,'default_value') FROM table
### SELECT NVL2(column,'not_null_value', 'null_value') FROM table

#### I'm using MySQL in this process and it does not support the NVL function, otherwise I would put an example here

## 4.	What is the difference between single-row functions and multiple-row functions?

### Single row functions are used on a single row of data at a time. These are most commonly used as Arithmetic or Date functions.
- Round, To_Date, Month etc.

In [27]:
q = '''SELECT MONTH('2015-08-02')
'''
pd.read_sql(q,conn)

   MONTH('2015-08-02')
0                    8

In [28]:
q = '''SELECT UPPER(username)
FROM users'''
pd.read_sql(q,conn)

  UPPER(username)
0        JOHN DOE
1        JANE DOE
2     ALICE JONES
3     LISA ROMERO

### Multiple row functions are used on multiple rows to provide a single result. Most commonly used with aggregate functions.
- Sum, Avg, Count
- Group by, Having

#### Below is users that attended more than 2 training sessions. Used multiple row functions

In [29]:
q = '''SELECT user_id
FROM training_details
GROUP BY user_id
HAVING COUNT(user_id) >2  '''
pd.read_sql(q,conn)

   user_id
0        1
1        3
2        4

## 5.What is the group by clause used for?

## Group by is used to combine rows that have shared values in specific columns. We do this to use aggregate functions like max,min,avg, etc.

#### Below I have used group by to show runners that have more than 1 race win.

In [30]:
q = '''SELECT races.winner_id, MIN(runners.name) AS winner_name
FROM races
JOIN runners ON runners.id = races.winner_id
GROUP BY races.winner_id
HAVING COUNT(races.winner_id) > 1;
'''
pd.read_sql(q,conn)

   winner_id winner_name
0        2.0    Jane Doe

## 6.Write a query to to get the list of users who took the a training lesson more than once in the same day, grouped by user and training lesson, each ordered from the most recent lesson date to oldest date.

In [31]:
q = '''SELECT training_details.user_id, training_details.training_id as training_id, MIN(users.username) as name, MAX(training_details.training_date) as latest_train_date
FROM training_details
JOIN users ON
training_details.user_id = users.user_id
GROUP BY training_details.user_id,training_details.training_id
HAVING COUNT(training_date) >1
ORDER BY latest_train_date DESC'''
pd.read_sql(q,conn)

   user_id  training_id         name latest_train_date
0        3            2  Alice Jones          8/4/2015
1        4            2  Lisa Romero          8/4/2015
2        4            3  Lisa Romero          8/3/2015
3        1            1     John Doe          8/2/2015

### This query returns the name, class_id, user_id and latest train date. It shows users that have attended more than 1 training session in one day grouped by the class_id